app/controllers/items_controller.rb

  def index
    if user_signed_in?
  	@items = Item.where(:user_id => current_user.id).order("created_at DESC")
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 2]]

  def complete
    @item = Item.find(params[:id])
    @item.update_attribute(:completed_at, Time.now)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2016-04-01 11:31:09.229574"], ["updated_at", "2016-04-01 11:31:09.230899"], ["id", 6]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "Brand,Cheese,Pasta,spinach"], ["updated_at", "2016-04-01 10:44:28.285566"], ["id", 2]]

  def create
  	@item = current_user.items.build(item_params)
  	if @item.save
---
INSERT INTO "items" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello World"], ["description", "That is test easy"], ["user_id", 1], ["created_at", "2016-04-01 11:08:50.827814"], ["updated_at", "2016-04-01 11:08:50.827814"]]

  def find_item

    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]